["Axis Europe is a real estate firm.", "Skanska is a project development and construction group, concentrated on selected home markets.", "VDE is a technical and scientific associations in Europe.", "Dassault Aviation is an aircraft manufacturer of military, regional, and business jets.", "ESET is an information technology security company that develops security software solutions.", "Greenpeace is an independent global campaigning organization based in Amsterdam.", "Playtech is an Online Gaming B2B Software Provider.", "Slaughter and May is an international law firm headquartered in London and a member of the Magic Circle of elite UK law firms", "Strabag is a technology company for construction, a leader in innovation and capital strength.", "Schaeffler is a manufacturer of automotive parts such as clutch, double clutch, clutch disc, friction lining, and dual mass flywheel.", "Aquarion AG is a leading provider of advanced water systems, solutions and technologies for the Oil & Gas industry", "German construction company", "Supermarket Groceries Chain in Sweden", "Atlas Copco specializes in manufacturing compressed air and gas equipment, generators, and industrial tool.", "Online automotive marketplace", "Air France-KLM offers passenger and cargo transportation services, aeronautics maintenance, and other air-transport related activities.", "All in one enterprise solution for performance oriented social media marketing", "CECONOMY AG is the leading European platform for companies, concepts and brands in the field of consumer electronics.", "SCOR, one of the largest reinsurers, provides its clients with a diversified and innovative range of solutions to control and manage risk.", "Full service, integrated communications network and we work with 6 of the top 10 and over half of the top 50 global advertisers", "ENGIE is a global energy player and an expert operator in the three key sectors of electricity, natural gas and energy services.", "Laing O'Rourke is a multinational construction company headquartered in Dartford, United Kingdom.", "A specialist in chronographs and technical watches, Breitling has also shared the finest hours in the conquest of the skies.", "Cisco develops, manufactures, and sells networking hardware, telecommunications equipment, and other technology services and products.", "BENTELER is an automotive company that designs, produces, and distributes safety-relevant products, systems, and services.", "Centre national de la recherche scientifique", "Develops pioneering technologies and services for sustainable and connected mobility of people and their goods", "foodora provides food delivery services.", "Panzani is the market leader in France in the dry and fresh pasta, rice, sauces, couscous and semolina businesses", "Solvay is a Belgium-based chemistry corporation that provides chemicals, materials, and solutions.", "BNP Paribas Corporate and Investment Banking", "BSH operates as a manufacturer of home appliances in Europe.", "Nordex is a management holding company with control and coordinating responsiblities.", "Trafikverket is responsible for state roads and railways as well as long-term planning of the overall transport system.", "ONERA is the leading French technology research in aeronautics, space and defense.", "Boeing Company manufactures and sells aircraft, rotorcraft, rockets, and satellites and provides product leasing and support services.", "Altran is an engineering company that provides research and development services for its clients.", "Capita plc provides customer and business process management, and professional support service solutions primarily in the United Kingdom.", "Knorr-Bremse is the global market leader for braking systems and supplier of other safety-critical rail and commercial vehicle subsystems.", "Norauto is the leader of the car center in France.", "Sweco AB (publ) provides consulting services in engineering, environmental technology, and architecture fields worldwide.", "Douglas is premium beauty retailer in the European beauty industry.", "Jaguar Land Rover Cars is a brand of Jaguar Land Rover, a British multinational car manufacturer headquartered in Coventry, United Kingdom.", "Princes is an international food and drink group involved in the manufacture.", "Lockheed Martin is a security company engaged in the research, development, and manufacture of advanced technology systems and products.", "AENOR provides the development of certifications and other conformity assessment services.", "Kaspersky Lab is a vendor of endpoint protection solutions for consumers, SMBs and enterprises.", "Official Twitter account for WABCO, a global supplier of technologies and services that improve the safety, efficiency and connectivity of commercial vehicles", "Lloyd’s is the world’s specialist insurance market.", "Skrill has been making digital payments simple, secure and quick since 2001. It provides online payments for both consumers and businesses.", "News, Sports, Movies & Entertainment", "EnBW is rank among the largest energy supply companies in Germany.", "Quadient helps companies deliver meaningful interactions with current and future customers.", "Discover the latest in women's fashion and men's clothing online", "BNR Nieuwsradio, a commercial radio station, offers the latest news in the fields of employment, entrepreneurship, economics, and business.", "Leading international commercial bank", "Mercedes-Benz USA manufactures sedans, coupes, SUVs and wagons, convertibles and roadsters, hybrid and electric cars, and car accessories.", "AXA is a French multinational insurance firm that focuses on global insurance, investment management, and other financial services.", "Verallia is a global glassmaking player providing innovative and eco-friendly solutions to your food and beverage packaging.", "DATEV Software house and IT service provider for tax consultants, accountants and lawyers as well as their clients.", "Voith | Home", "Dentsu Aegis Network is the first digitally native network that specializes in media, digital and creative communications services.", "Saint-Gobain designs, manufactures, and distributes building materials and solutions.", "Emerson is a global technology & engineering company providing innovative solutions for customers in industrial and residential markets.", "Helvetia is active in the life, property and casualty and reinsurance business", "LUKOIL is a major international vertically-integrated oil & gas company, accounting for 2.1% of global output of crude oil.", "Southern Water is a private utility company responsible for public wastewater collection and treatment.", "SFR operates as a mobile telecommunications operator that offers mobile telephony services.", "Apple is a multinational corporation that designs, manufactures, and markets consumer electronics, personal computers, and software.", "DFS Deutsche Flugsicherung is responsible for the air traffic control in Germany.", "AMCo manufactures and distributes generic pharmaceutical prescription products for distributors, wholesalers, hospitals, pharmacies, patients, and doctors worldwide", "Doc Morris is an online provider of medical and pharmaceutical products.", "reBuy is an online marketplace that allows its users to buy and sell used electronics and media.", "AFAS Software develops software products for businesses.", "An international sporting goods retailer", "Dunelm is the UK's home furnishing retailers. Shop for bedding, curtains, furniture, beds, and mattresses.", "HP is a manufacturer and seller of personal computers, printers, computer hardwares, and business solutions.", "COWI is one of Sweden's leading technology consulting firm.", "Dalkia is an energy service company that offers management and maintenance services to operators of industrial production sites.", "Ernst & Young Limited is a global leader in assurance, tax, transaction and advisory services.", "DKSH is a market expansion services provider firm with a focus on marketing, sourcing, analysis, sales, logistic, and after-sales services.", "Bitdefender is a global security technology company that provides advanced threat protection to both business and consumer customers.", "Holland & Barrett is a chain of health food shops with over 1,300 stores in 16 countries.", "General Electric offers infrastructure and financial services worldwide.", "Ferring is a biopharmaceutical company dedicated to the development of innovative treatments that make a real difference in people’s lives.", "GL events provides event-related services and solutions.", "Nationwide Building Society is a British mutual financial institution and the largest building society in the UK.", "A group with mutualist values, Macif brings together almost 5m members to protect what is essential to everyone - life, family and property.", "Ricola is one of the most modern and innovative manufacturers of herb drops in the world.", "The World Food Programme is the food assistance branch of the United Nations and the world's largest humanitarian organization", "National Grid facilitates electricity and gas transmission system and focuses on delivering clean energy.", "Beckhoff implements open automation systems based on PC Control technology.", "British American Tobacco is a tobacco group, with brands sold in more than 200 markets.", "Glovo is a courier service that purchases, picks up, and delivers products ordered through its mobile application.", "Nuovo Trasporto Viaggiatori is a private operator on the high-speed rail network.", "Eiffage focuses on construction, property development, civil engineering, and energy projects.", "Renault designs, manufactures, sells, repairs, maintains, and leases motor vehicles.", "ARD is an online information resource that features news and other articles related to sports, culture, children, and more.", "Bouygues Immobilier is a leading French real estate and urban developer.", "Wise Group is a recruitment, expert staffing, and human resource consultancy firm.", "One of the world's leading tyre manufacturers", "MindShare is an exclusive forum designed to help emerging companies and their CEOs build successful businesses.", "Ramirent is a rental equipment group combining the best equipment, services and know-how into rental solutions.", "Harrods is an upmarket department store located on Brompton Road in Knightsbridge, in the Royal Borough of Kensington and Chelsea, London.", "German global discount supermarket chain", "A1 Telekom Austria is a communications company that offers a range of services.", "A network of online food ordering sites with over 100 restaurant partners worldwide", "eBay is an online marketplace that connects a global network of buyers and sellers.", "The Coca-Cola Company distributes coke, diet coke, and other soft drinks.", "Informa is a business intelligence, academic publishing, knowledge and events group.", "Gestamp is a service provider of design, development and manufacture of metal auto parts for automotive industry.", "Alstom is a global leader in the world of power generation, power transmission, and rail infrastructure.", "Lloyds Bank is the largest retail bank in Britain", "DACHSER provides logistics services.", "Royal Dutch Shell is a global group of energy and petrochemicals companies.", "RSA is a multinational insurance group.", "Private Swiss Post", "VDAB offers employment and vocational online training services.", "Schuco provides system solutions for windows, doors, and facades.", "Creditsafe Business Solutions provides financial information, company status and credit reports of businesses.", "Vonovia SE is a housing association of Germany managing over 370,000 homes.", "Food and Agriculture Organization (FAO) is a specialized agency of the United Nations that leads international efforts to defeat hunger.", "Merck is a  healthcare, life science  company.", "Specialist electrical and telecommunications retailer and services company", "Almirall is an international pharmaceutical company based on innovation and committed to health, headquartered in Barcelona, Spain.", "Interflora offers an online platform that enables its users to choose and buy from a range of flower products.", "Multinational utility company managing the supply of electricity and gas to businesses and consumers in the United KIngdom and North America", "BP delivers heat, light and mobility products and services to people all around the world.", "Leaseweb is a cloud hosting provider offering advanced infrastructure solutions for a global market.", "lifebrain is a holding company based in Austria that makes investments in the laboratory diagnostics sector.", "Yandex is a multinational technology company that provides internet-related services and operates a search engine platform in Russia.", "Sodexo is now the worldwide leader in Quality of Life services.", "Bluestone is an IT company that offers solutions for Product Information Management (PIM) and Omnichannel Management.", "EUROPA PRESS provides Spanish communication and news services on national, international, economic, sports, and health issues.", "Lastminute is a website for purchasing all types of travel and entertainment event tickets.", "CTS Eventim operates in the leisure events market worldwide.", "Schott is a international technology group in the areas of specialty glass and glass-ceramics.", "Bank", "Arkema is a chemicals producer and is specialized in specialty chemicals.", "Perfetti Van Melle is a privately owned company, producing and distributing candies and chewing gums in more than 150 countries worldwide.", "Algemeen Dagblad is an online news portal that covers sports, entertainment, business and science.", "A leader in consulting, technology and outsourcing services", "Home delivery of recipes and ingredients to encourage home cooking", "REHAU Group | Unlimited Polymer Solutions", "Bertelsmann is a transnational media corporation that operates in about 50 countries around the world.", "Motorola provides products and services for mobile, wireline digital communication, information, and entertainment applications.", "Automobile manufacturer", "Vistaprint empowers more than 12 million micro businesses and consumers annually with affordable.", "Macmillan Publishers Ltd is one of the largest and best known international publishing groups in the world.", "Club Med sells vacations and related services, operates villages and cruises, and provides tours and discovery programs.", "NNIT​ is one of Denmark’s leading consultancies in IT development, implementation and operations.", "Folksam is one of the largest insurance companies in Sweden.", "Communications and Entertainment", "WAGO Kontakttechnik is an automation controls and interface electronics company.", "Sanitas is the brand of Hans Dinlage GmbH it has been a successful brand in the wellness and health market.", "Express deliveries worldwide", "Bonnier is a media group working in TV, daily newspapers, business and trade press, magazines, film, books, radio and digital media.", "Axfood is conducts food retail and wholesale business in Sweden.", "Germany's leading train ticket booking service", "Autogrill provides catering services for travelers.", "hybris offers enterprise software and on-demand solutions for multi-channel commerce, master data management, and order management.", "Vorwerk is an international diversified corporate group headquartered in Wuppertal, Germany.", "Exclusive, members only discounted offers for hotels and luxury holidays", "Lesaffre acts as a global key player in yeasts and fermentation.", "RTVE is a media corporation that publishes an online newspaper that is in Spanish.", "La Redoute is an e-commerce website that offers clothing and accessories for women, men, and children, home appliances, and more.", "Pernod Ricard, conviviality creators", "Sephora is an online shopping site that offers a wide range of beauty products such as cosmetics and skincare items.", "A Swedish founded Dutch based multinational group, that designs and sells ready to assemble furniture", "Orpi provides real estate management services in the France.", "Bonduelle produces quality products by selecting the best crop areas close to its customers.", "Playrix is the company behind Township, Fishdom, Gardenscapes and Homescapes.", "NetEnt is a provider of premium gaming solutions to the world’s most successful online casino operators.", "LINK is provides transportation, forwarding, and logistics services.", "Booking platform for tours, attractions and activities", "Vitra is a Swiss company dedicated to improving the quality of homes, offices and public spaces through the power of design", "BSI Group, also known in its home market as the British Standards Institution, is a multinational business services", "Butagaz is a privately held French natural gas distributor company.", "Pilz is a innovative automation technology company as experts in the safety of human, machine.", "AKI is an easy DIY stores where you will find everything you need for the repair, maintenance and improvement of your home and garden.", "SAP is a technology company that develops enterprise application software for companies and industries across diverse sectors.", "Damm is the idea of brewing a beer adapted to the Mediterranean climate.", "Sogetrel provides communications network installation and system integrations services.", "SITA is an air transport IT and communications specialist, providing IT and telecommunication services to the air transport industry.", "Consulting services and solutions, ranging from supporting strategy development to enterprise solutions and technology", "The Camfil Group is a world leader in the development and production of air filters and clean air solutions.", "Endesa is an electric utility company that operates the electric power industry.", "Bricorama provides sale of garden tools and construction materials.", "Telit (AIM:TMC) enables end-to-end IoT solutions.", "Total is one of the world's major oil and gas groups, with activities in more than 130 countries.", "Switzerland based multinational financial services holding company", "Legal expenses insurance in Spain", "Barilla is an Italian food company that is popularly known for its pasta, sauces, bakery products, and crisp breads.", "Legrand is the global specialist in electrical and digital building infrastructures.", "Clarion Events can trace its roots back to 1947 and takes great pride in being one of the oldest independent event organisers.", "Ipsos is a global market research company specialized in advertising, loyalty, marketing, media, and public affairs market research.", "Lufthansa is an european group airline in India and considers India as one of the most important long-haul markets.", "Google is a multinational corporation that specializes in Internet-related services and products.", "Samsung Electronics is an electronics company engaged in consumer electronics, IT and mobile communications, and device solutions.", "Swissquote Group is committed to continue expanding its leading position in online financial services.", "Wix provides a platform for the development of cloud data services for millions of registered users worldwide.", "Shawbrook Bank is a provider of financial services including savings and loans in the UK.", "Equinor is an energy company that specializes in providing oil, gas, wind energy, and solar power energy.", "Microsoft is a software corporation that develops, manufactures, licenses, supports, and sells a range of software products and services.", "North Atlantic Treaty Organization is a military alliance formed between 26 nations to enforce the North Atlantic Treaty of 1949.", "Danfoss energy-saving technologies enable intelligent communities and industry to create a healthier and more comfortable climate.", "Euronext is the pan-European exchange in the Euro zone that connects local economies to global capital markets.", "Europe 1 is a private general radio belonging to Lagardère.", "Operates worldwide with leading brands and technologies in three business areas: Adhesives, Beauty Care and Laundry & Home Care", "INRA is Europe’s top agricultural research institute and the world’s number two centre for the agricultural sciences.", "Egmont is a media production company.", "Manpower is a job recruitment firm engaged in providing Manpower, and talent solutions to the clients.", "To discover, develop and successfully market innovative products to prevent and cure diseases, to ease suffering", "Ravensburger is the supplier of puzzles, games and creative products.", "MAIF offers liability insurance to its residents who are unable to obtain automobile insurance in the private market.", "Circle provides medical and health care services.", "Sony Electronics (SEL) is the U.S. sales and marketing arm of Sony’s global electronics business. It is a leading provider of audio/video", "DB Schenker is a supply chain management and logistics solutions, handling everything from logistics to customized shipping solutions.", "CNP Assurances is a personal insurer platform that designs and manages life insurance, pension, personal risk, and protection products.", "eToro is a social trading and investment marketplace that allows users to trade currencies, commodities, indices, and stocks.", "Partner Communications Company is a mobile network operator, internet Wi-Fi, fixed telephony service and OTT/IPTV provider in Israel.", "Sogeti is a technology and software testing company specializing in infrastructure, application, and engineer services.", "ISS is a leading workplace experience and facility management company.", "Novozymes is the world leader in bioinnovation.", "RFI Rete ferroviaria Italiana", "Crédit Agricole Toulouse 31 supports individuals and professionals in the realization of their projects and the management of their wealth.", "Huge selection, low prices, Best Brands.", "Epiroc is a productivity partner for the mining, infrastructure and natural resources industries.", "MediaCom is one of the world's leading media agencies.", "Melexis specializes in the design and marketing of semi-conductors.", "Adesso is an IT company based in Germany that provides consulting and software development solutions.", "TRUMPF provides manufacturing solutions in the fields of machine tools, laser technology, and electronics.", "TalkTalk is a phone and broadband company that offers fixed and mobile telephony and broadband services to consumers.", "Iberdrola is a producer and distributor of energy services.", "Avast is a security software development company that protects people from threats on the internet.", "Boehringer Ingelheim is a group of companies embracing many cultures and diverse societies.", "#1 hotel booking site owned by Booking Holdings", "IWC Schaffhausen - the Swiss watch manufacturers.", "Leading player in end-to-end supply chain management", "Webhelp is a business process outsourcer (BPO), specialising in customer experience and payment management.", "TecAlliance is a digital solution firm that offers supply chain, e-business, data, and product management services.", "One of the world's largest steel producers", "Arup is an independent firm of designers, planners, engineers and technical specialists offering a broad range of professional services.", "Elecnor Deimos is providing engineering and development solution for aerospace, satellite systems, remote sencing, information system.", "The Royal Bank of Scotland is a bank providing retail banking services throughout the United Kingdom and Ireland. ", "Fraport AG is among the leading groups of companies in the international airport business.", "Power tools for construction, agriculture, landscape, forestry and private users", "Leading manufacturer of household appliances", "Asda owns and operates a chain of supermarkets that sell various products.", "Waitrose is a chain of British supermarkets, which forms the food retail division of Britain's largest employee-owned retailer.", "Exact helps SMEs and accountants with solutions for accounting, finance, ERP, HRM, and CRM processes.", "Publisher of free to play multiplayer online games", "Infobip specializes in omnichannel engagement powering a range of messaging channels, tools, and solutions for advanced customer engagement.", "CSEM is a private Swiss research and technology organization specializing in micro- and nanotechnology.", "WILO is the manufacturers of pumps and pump systems for building services.", "Ziggo was established on 1 February 2007, following the merger of @Home, Casema and Multikabel.", "Debenhams is a international, multi-channel brand with a proud British heritage which trades out of 240 stores across 28 countries.", "Awin is a global affiliate network and the new name for affiliate window and zanox.", "Privalia is an e-commerce website that trades fashion and household products.", "Barbour is a 120 year old global brand defining the essence of true British style.", "Fresenius Medical Care is a healthcare company that provides dialysis treatment for those with chronic kidney diseases.", "HILTI makes construction work simpler, faster, and safer. We design, manufacture, and sell tools and fastening solutions worldwide.", "Is a British multinational banking and financial services company", "Lamoda is the largest Russian online store of clothes, shoes, accessories and beauty merchandise; offering express delivery.", "Switzerland’s leading telecom provider", "Cdiscount is an e-commerce website offering a wide range of products including high-tech, IT, household appliances, and personal app.", "STMicroelectronics is a global leader in developing and delivering semiconductor solutions", "Finnair is an airline company that offers the fastest and most convenient gateway between Europe and Asia, via Helsinki.", "Rabobank is a financial services provider that focuses on the food, beverage, and agribusiness sectors.", "Home — Roland Berger", "CHANEL is provider of latest in fashion & accessories, eyewear, fragrance & beauty, fine jewelry and watches.", "DS Smith is a provider of corrugated & plastics packaging, supported by paper & recycling operations", "BELECTRIC specializes in the development and construction of ground-mounted solar power plants and roof-mounted photovoltaic systems.", "MAPFRE a global insurance company.", "Nestlé manufactures and sells food and beverage for several countries.", "PZ Cussons is a multinational consumer goods business.", "RightMove is the UK's largest property portal allowing home hunters to find details of properties to buy or rent.", "Mobile payments company", "CNH Industrial is a capital goods company that provides a wide range of industrial products.", "PepsiCo is a food and beverage company that makes enjoyable foods and beverages that are loved throughout the world.", "Creates data driven winning strategies", "Regus offers office spaces, virtual office spaces, meeting rooms, videoconferencing suites, and business lounges for rent.", "One of the largest digital publishing houses in Europe", "Laposte is a French company which provides offline and online postal services for customers and businesses.", "Saga is a specialist in products and services for life after 50.", "Empa is an interdisciplinary research institute of the ETH Domain for materials science and technology development.", "Solteq is a digital commerce expert that provides you with integrated total solutions for multichannel commerce.", "Veolia group is the global leader in optimized resource management. With nearly 179,000 employees worldwide, the Group designs and provides water, waste and energy management solutions which contribute to the sustainable development of communities and industries. Through its three complementary business activities, Veolia helps to develop access to resources, preserve available resources, and to replenish them. In 2019, the Veolia group supplied 98 million people with drinking water and 67 million people with wastewater service, produced nearly 45 million megawatt hours of energy and treated 50 million metric tons of waste. Veolia Environnement (listed on Paris Euronext: VIE) recorded consolidated revenue of €27.189 billion in 2019 (USD 29.9 billion).", "Dyson is a global technology company that designs iconic reinventions that work, perform and look very different.", "The U.S. Army provides land-based military operations.", "Falck A/S is a Nordic-based organization with activities in most areas of Europe and representation on five continents.", "Endemol Shine Group is a global production powerhouse creating world class content for all platforms.", "The World Summit Award is a global initiative to select and promote the world's best in e-content and creativity.", "Maserati manufactures and sells a range of European automobiles.", "Ubisoft is a producer, publisher, and distributor of interactive entertainment products. ", "Genesis is a global Internet company that has developed a number of sizable and fast-growing internet projects.", "TomTom is a digital mapping and routing company focusing on car navigation.", "Ebury is a financial services company designed to empower small and medium-sized businesses that want to trade internationally.", "Flos designs, develops, and markets a range of lighting products.", "Royal Mail is the UK’s sole provider of the universal service.", "GE money is a financial service company providing financial solutions.", "Viber allows people to connect through individual messaging, video calls, group chats or following brands and celebrities on Public Chats.", "BBVA is a financial company that provides a variety of banking services online.", "Natixis is the international corporate, investment, insurance and financial services arm of Groupe BPCE.", "PRADA is an E-commerce Company.", "Quintessentially is a U.K.-based company that provides private and corporate concierge services worldwide.", "Manufacturer of robotic systems", "Securitas operates as a security platform.", "Cashless payments provider", "Taylor Wessing is a full-service international law firm.", "Switzerland's largest retail company", "Provider of language and translation services", "Nespresso SA is independent mobile app develop[er company. They exclusively develop and publish apps for iOS running devices i.e. iPhon", "Ryanair is Europe’s only ultra-low cost carrier (ULCC), operating more than 1,500 daily flights (over 500,000 per year) from 57 bases.", "ZDF is a web portal for information and news. It offers a full program of informatio", "ConsenSys develops enterprise applications, invests in startups, builds developer tools, and offers blockchain education.", "Sophos develops network security and threat management products to protect organizations against malicious acts.", "Leading manufacturer of high quality cars", "Eaton Corporation is a diversified power management company for electrical, hydraulic, and mechanical applications.", "Oerlikon is a leading high-tech industrial group specializing in machine and plant engineering.", "International technology group with three core businesses: aerospace, defense, and security", "Haymarket is a media and information company that creates award-winning specialist content for international audiences.", "Spanish financial services company", "Randstad is a global solutions provider in staffing and recruitment consultancy and placing talent in permanent and temporary job positions.", "Media broadcaster", "Sennheiser develops, manufactures, and markets headphones, headsets, microphones, and integrated systems.", "Monoprix SA is engaged in retail distribution through department store chains including the Monoprix, Super Monoprix, Inno and Prisunic.", "The leading global travel search site providing instant online comparisons for millions of flights plus hotels and car hire", "Ferrari is an Italian company that designs and manufactures sports cars.", "Kone is to make the world’s cities, buildings and public spaces, they believe that cities of the solution for a better future.", "RAC has been consistently at the forefront of developing motoring services.", "Cabify is a ride-sharing company that operates in Latin America, Spain, and Portugal.", "Infineon Technologies offers semiconductor solutions, microcontrollers, LED drivers, sensors and Automotive & Power Management ICs.", "Maersk is an integrated container logistics company working to connect and simplify its customers’ supply chains.", "Kinnarps is a workspace solutions company.", "Wavemaker provides next-generation media, content, technology solutions, and advertisement services to reinvent the media agency.", "Sectra is a company that creates and sells products in secure communication and medical information technology.", "Experience More. Discover, explore and share more music, TV shows and brands you love", "Leading online shoe and fashion store outside of the USA", "Celonis is the market leader in AI-enhanced Process Mining and Process Excellence.", "Helsingin Sanomat operates as a subscription newspaper.", "Farfetch is an online luxury fashion retail platform.", "Iberia operates a commercial airline and travel service for clients in Latin America and the rest of the world.", "Tesa AG manufactures and markets self-adhesive products and system solutions for industry, trade, and consumer sectors worldwide.", "Turkish Airlines, one of the most preferred leading European air carrier with global network coverage.", "Zenuity is a joint venture of Volvo Cars and Veoneer in the automated driving technology space.", "EDP ​​is a global energy company in value creation, innovation and sustainability.", "SodaStream manufactures home beverage carbonation systems that enable consumers to transform tap water into carbonated soft drinks and more.", "CMS is a commercial law firm that provides clients with advice in a wide range of law and tax matters.", "Scout24 operates digital marketplaces in the real estate & automotive sectors.", "Bank of Scotland is a commercial and clearing bank based in Edinburgh, Scotland.", "PicPay is a digital wallet app that enables users to send and receive money, pay bills, store loyalty cards and discount coupons, and more.", "Home – ArcelorMittal", "Dr. Martens US store for boots, shoes, sandals, clothing, bags and accessories.", "Arvato is an international service provider living on and with digital technology.", "Glencore operates various commodity industries include coal, copper, cotton, grain and oilseeds, nickel and zinc.", "Moleskine develops and sells notebooks, diaries, portfolios, purses, writing materials, reading articles, and many other products.", "Bringing you the latest from the world of work, job opportunities, careers advice, our short film competition, courses and all things reed.", "Telefonica is a diversified telecommunications group that provides fixed line and mobile telephone services.", "CANCOM Cloud Transformation Partner, Systemintegrator & Managed Services Provider", "Social sound platform where anyone can create and share sounds", "TeamSystem develops and distributes management software solutions for professionals, businesses, legal practices, and artisans in Italy.", "Online hotel search platform that compares prices from various hotels on booking sites worldwide", "Nissan is a multinational automobile manufacturer that sells its cars under the Nissan, Infiniti, and Datsun brands.", "Wix.com is a free website creation service that has been voted by over 160 million people worldwide.", "The most innovative portfolio of Taste & Nutrition technologies and  Ingredients & Actives for the global food, and beverage industries.", "TeamViewer is an all-in-one solution for remote access, support, collaboration and desktop sharing over the internet.", "Enedis manages the public electricity distribution network for 95% of continental France.", "Uber develops, markets, and operates a ride-sharing mobile application that allows consumers to submit a trip request.", "NOS are the best communications and entertainment group in Portugal.", "Vorsprung durch Technik", "DW is a German provider of radio and television broadcasting services in Germany and internationally.", "Indra provides information technology offerings for finance, insurance, public administration, airports, defense, healthcare, and media.", "ERDF manages the public electricity distribution network for 95% of continental France.", "SMA Solar Technology  is a german solar energy equipment supplier.", "Le Monde is a French daily evening newspaper owned by La Vie-Le Monde Group and edited in Paris.", "Nationale-Nederlanden is one of the largest and most influential financial services providers in the Netherlands.", "The Neue Zürcher Zeitung (NZZ) is a daily newspaper published by the NZZ-Gruppe in Zurich.", "The Bosch Group is a global supplier of technology and services.", "ADB SAFEGATE is a provider of solutions that boost efficiency, improve safety, raise environmental sustainability.", "Bayer is a multinational pharmaceutical and life sciences company.", "Societe Generale is a French multinational investment bank and financial services company headquartered in Paris, France.", "TAGHeuer is a manufacturing company that designs and markets luxury watches and related fashion accessories.", "Carlsberg produces and sells beer and other beverage products together with its subsidiaries.", "Sberbank offers the widest selection of banking services for retail customers.", "Northvolt develops sustainable lithium-ion batteries in conjunction with R&D, industrialization, and recycling to support clean energy.", "Offers insurance solutions", "EWE is a service provider active in the business areas of sustainable energy supply.", "JCDecaux is an outdoor advertising company.", "Guerlain is a French perfume and cosmetics and skincare house, among the oldest in the world.", "ACCIONA is the development and management of infrastructure, renewable energy, water, and services.", "Nokia is a Finnish multinational communications corporation engaged in the manufacturing of mobile devices and network infrastructure.", "Etam is to be always attentive to the expectations and desires of its customers.", "Scandic Hotels Group engages itself in operation of hotels.", "Intermarche is a service that shows what the best offers are for specific products.", "Demcon supplies high-end technology products and systems such as optomechatronic, robotic and medical systems.", "LG Electronics is a multinational company which includes LG Electronics.", "Renfe is a service rail transport of passengers and goods under the Ministry of Development.", "A major German shoe and sportswear retail chain", "One of Europe’s five leading electricity and gas companies", "Monzo is a digital-only bank platform and marketplace that allows customers to access a range of products and services.", "Aviva Investors is a global asset manager with expertise in real estate, fixed income, equity, multi-asset and alternative investments.", "FLSmidth supplies engineering, equipment, and services to the minerals and cement industries.", "DLR is the national aeronautics and space research centre.", "OECD is the Organization for Economic Cooperation and Development.", "Ageas is an international insurance Group that offers retail and business customers life and non-life insurance products.", "Bostik is a company that manufactures adhesives and sealants for diverse markets.", "Department stores and online stores", "Ringi­er AG is the largest internationally op­erating Swiss me­dia compa­ny, produc­ing over 120 newspapers and mag­a­zines.", "GumTree is an online classified ads and community site that provides users with a platform to find and advertise rooms, flats, and houses.", "Krones – we do more.", "Nike designs, develops, and markets footwear, apparel, equipment, and accessory products.", "Postbank is a broad branch network throughout the country and a significant client base of citizens, companies and institutions.", "Emarsys enables brands around the world to deliver truly personal customer interactions across email, mobile, social, and web – at scale.", "A wholesale provider of reinsurance, insurance and other insurance based forms of risk transfer", "Gazprom is a global energy company. Its major business lines are geological exploration, production, transportation, storage, processing", "Deutsche Bahn is a passenger and logistics company.", "Bambora is a developer of payment software for online purchasing platforms.", "Otto Group is a globally operating retail and services group.", "Somfy is the world leader in the automatic control of openings and closures in homes and buildings.", "The venerable family run company conquers the world of travel", "Old Mutual Group is an international investment, savings, insurance, and banking group.", "Amazon is an e-commerce website for consumers, sellers, and content creators.", "Infrabel is the infrastructure manager of the railways in Belgium.", "Revolut is a financial services company that specializes in mobile banking, card payments, money remittance, and foreign exchange.", "Autoliv is a holding company and a supplier of automotive safety systems.", "Halifax is a banking chain in the United Kingdom.", "Global leader in automotive equipment", "Germany's price comparison site with 199M offerings from more than 34K online shops", "Essent", "Leroy Merlin offers products and solutions for DIY, decoration, constr,uction and gardening.", "Ericsson is a technology company that provides and operates telecommunications networks, television and video systems, and related services.", "Sandvik is a high-technology, engineering group with advanced products and a world-leading positions within selected areas.", "Husqvarna Group produces outdoor power products, including chainsaws, trimmers, robotic lawn mowers, and garden tractors.", "CERTEGO is the right partner in the security solution for those who have business in Sweden or across borders in Scandinavia.", "Walmart is a multinational retail corporation that operates several chains of discount department and warehouse stores.", "Allegro provides a safe shopping platform for a computer, tablet, and smartphone.", "Bankia is a Spanish bank formed by consolidating the operations of seven regional savings banks.", "IMMOFINANZ is a commercial real estate company.", "Paysafecard provides consumers with an online payment option without the use of a bank account or credit card.", "artegic provides a SaaS-based marketing automation solution for medium to large enterprises.", "Signify provides lighting products and systems for homes and professional segments", "AccorHotels is a French multinational hospitality company.", "Wolt is a food delivery company specializing in real-time logistics optimization.", "Lafarge is an industrial company building material products.", "Network Rail develops Britain’s rail tracks, signaling, bridges, tunnels, level crossings, and so on.", "Knight Frank is an independent, global real estate consultancy providing an integrated prime commercial and residential offering.", "Bisnode offers a range of online marketing, risk management, and business information solutions that enable clients to make smart decisions.", "Vienna Insurance Group focuses on providing custom products and services for long-term profitability and steady earnings growth.", "Decathlon is an online shop for buying sports goods.", "IDEMIA offers identity and security solutions for an increasingly digital and connected world.", "A medical technology company specializing in prosthetics and technical orthopaedics", "Manufacturing of building materials", "EDEKA offers mobile-based application platform that runs in android and IOS-based devices that allows its users to make mobile payment.", "An international organisation of independent electrical retailers who have joined together to form a cooperative partnership.", "Global is a media and entertainment company that operates commercial radio stations.", "Insta is an OEM service provider and specializes in the manufacturing of electronics, systems, software, and electromechanical equipment.", "MSL is Publicis Groupe’s Global Public Relations and Integrated Communications Partner.", "Berliner Volksbank offers current accounts, loans, home finance, savings, mortgages, consultation, private banking, and real estate service.", "Oxfam is a charitable organization NGOs working to end the injustices that cause poverty.", "Panasonic manufactures and sells various electronic and electric products around the world.", "Bechtle ist Ihr Partner für zukunftsfähige IT Architekturen. Impressum: https://t.co/6oDeZh6GbN Datenschutzerklärung: https://t.co/i8wggRSAs7", "Brussels Airlines is the flag carrier and largest airline of Belgium based and headquartered at Brussels Airport.", "John Lewis is a retailer that operates department stores, home stores, supermarkets and convenience stores in the U.K. and internationally.", "McDonald's is a global foodservice retailer generating revenue through company-owned restaurants, franchise royalties, and licensing pacts.", "Symrise is a global supplier of fragrances, flavorings, cosmetic active ingredients, raw materials and functional ingredients.", "AEGON Direct Marketing Services Europe Ltd. (ADMS Europe) is a leading provider of direct marketing and strategy development services", "Scania is a manufacturer of heavy trucks and buses as well as industrial and marine engines.", "Colruyt Group is a family-owned retail company that operates in the food and non-food distribution sector.", "CEA is a French government-funded technological research organisation.", "Carl Zeiss is a German manufacturer of optical systems, industrial measurements, and medical devices.", "With more than 60 years of history in the bag, ours is a brand with an impressive heritage.", "Yle is a Finnish public service media company and the most diverse community of creative work in Finland.", "A worldwide leading specialist for the design and production of control systems.", "Credit Plus delivers the information and services mortgage professionals", "Bouygues offers construction and cellular communications services, develops real estate, produces media, and manages utilities.", "Jeff is the first ecosystem offering daily services to users in +40 countries through an omnichannel value proposition.", "Netflix is an online streaming platform that enables users to watch TV shows and movies.", "Transport for London is the integrated body responsible for London''s transport system.", "Leader in car rental services in Europe", "Icaew provide our members with knowledge and guidance based on the highest ethical and technical standards.", "Wolters Kluwer provides its clients with information services and software solutions.", "Grifols is a global healthcare company.", "A worldwide leader in innovative lighting products as well as intelligent and connected lighting solutions (Smart Home).", "Movistar is a Spanish mobile phone operator offering fixed and mobile telephony and broadband services for its clients. ", "Dell transforms computing and provides high-quality solutions for people and businesses to be ready to move forward.", "Atento is the company in Business Process Outsourcing and Customer Experience Management services.", "Mars manufactures a wide range of pet food, confectionary, and other culinary products.", "Das ist der offizielle Lufthansa_DE Twitter Kanal. Anregungen, Lob oder Kritik: https://t.co/ez9Kj2hvJa Informationen zum Datenschutz: https://t.co/aFhyxUD63u", "Car rental since 1912", "Bestseller is web-shop of brand clothes and accessories.", "Adyen offers Adyen platform that integrates gateway, risk management, processing, acquiring, and settlement of payments.", "OVHcloud is an independent French company that offers web, dedicated, and cloud hosting solutions.", "The Ströer Group offers advertisers individualized Out-of-home and online communication solutions.", "MAN Truck & Bus, with headquarters in Munich, is one of the international suppliers of commercial vehicles and transport.", "A diversified technology company improving people's lives through innovation", "gategroup is an independent airline services company.", "UPC is the European division of Liberty Global, Inc.,", "Ginkgo Umbrella offers a collection of personalized, eco-sustainable umbrellas made in polypropylene.", "Gleiss Lutz is a full-service independent law firm.", "Unibail-Rodamco-Westfield is a global developer and operator of flagship shopping destinations.", "Wärtsilä is a global leader in smart technologies and complete lifecycle solutions for the marine and energy markets", "BMZ develops and manufactures high-quality lithium-ion battery systems for automotive, e-mobility, storage, and medical industry.", "Adecco is an HR company that specializes in recruitment, staffing, outplacement, and temporary work worldwide.", "Nordic Semiconductor World leading semiconductor company specializing in ultra low power short range wireless communication.", "GRENKE Group solutions help customers all over the world to develop their business in exactly the way they choose.", "Smart offers its members with solutions to create a salaried job and a range of services in legal, financial, training and administration.", "Finastra provides the broadest portfolio of financial services software.", "mBank of 13 years is the leader of e-banking in Poland. Our mission is to maximize benefits and convenience in personal and corporate", "Builds novel interfaces for neurorehabilitation, game training and 3D imaging in real time", "Masmovil, a Spanish mobile network operator (MNO).", "Axians is an independent IT company with a consulting, services, software, hardware and IT operations.", "Canon specializes in cameras, healthcare technologies, and business consultancy worldwide with its imaging innovation.", "Clear Channel UK is part of Clear Channel Outdoor,one of the world’s leading Out of Home media owners.", "QIWI is a payment service that enables its users to make payments to individuals, the internet, and mobile communication channels.", "Provides a standardized solution for creating cryptocurrency smart tokens", "Groupe BPCE provides a range of banking and insurance services in France.", "Achmea is an insurance company that provides its clients with health, life, and non-life insurance services.", "Worldpay is a global leader in payments processing technology and solutions for their merchant customers.", "Barco is a technology company designing and developing visualization products for a variety of selected professional markets.", "Diageo is a premium drinks business with an outstanding collection of beverage alcohol brands across spirits, beer, and wine.", "Smava is an online loan comparison platform that offers cheaper loan options to consumers.", "FDJ Group , its missions, its games offers, its CSR strategy, as well as its various expertise in France and internationally.", "VolkerWessels is a construction firm that is focused on the design, development, realisation and management of construction projects.", "Turkcell is a GSM-based mobile communications company providing a variety of audio and data communication services.", "LANXESS is a specialty chemicals company.", "The Natural History Museum in London is a treasure in every way. Join us for updates on our science, collections and all our activities.", "Radio France is a French public service radio broadcaster which specialises in entertaining and informative talk mixed with a wide variety", "Savills plc. is a global real estate services provider listed on the London Stock Exchange.", "Harvey Norman is an Irish retailer of furniture, bedding, electrical, and computers.", "Rebel allows users to send interactive emails with no plug-ins required, increasing engagement, conversions, and actions.", "They embrace change and are constantly challenging tradition because we have a strong desire to improve the way our industry operates.", "The Bank of England serves as the central bank of the United Kingdom.", "Galderma offering a range of medical and consumer skin health solutions through three business units.", "Tele2 is a Telecommunications company.", "Nachi is a mechanical and Industrial engineering company located in Birmingham.", "Volvo Aero operates as an aircraft and rocket engine manufacturer.", "At Ramboll, our 13,000 consulting engineers, designers and management consultants are committed to creating sustainable.", "VARTA AG is a German company manufacturing batteries for global automotive, industrial, and consumer markets.", "Sagemcom is a leading European group on the high added-value communicating terminals market that is based in France.", "Gemalto is a digital security company that offers mobile connectivity, payment technology, and data protection solutions to manage services.", "DNB is a financial services group that offers financial services through mobile, online banking, bank offices, and international offices.", "A global leading sports brand", "With a Group revenue of €13.5 billion in 2015, HeidelbergCement is one of the world’s largest building materials companies.", "Noxell Corporation manufactures and markets perfumes, colognes, cosmetic, and toiletry products under CoverGirl brand name.", "Swatch is a Swiss fashion brand that creates designer jewelries and watches for its worldwide users.", "Affidea, the Pan-European provider of diagnostic imaging and cancer treatment services.", "Vodafone is a mobile telecommunications company that offers voice, messaging, and data services.", "BearingPoint offers management and technology consulting services that transforms businesses by creating customized solutions.", "Metabo in Nurtingen is a traditional manufacturer of power tools for professional users.", "Raiffeisen Bank International specializes in corporate finance, mergers, and acquisitions.", "ScaleFocus is a European IT solutions delivery center.", "The leading global natural and built asset design and consultancy firm.", "GRTgaz is a gas transportation network in France.", "Service platform for insurance brokers insurers and end customers", "Science led global healthcare co with a special purpose: to help people to do more, feel better, live longer", "Aurubis is the leading integrated copper group and the world’s largest copper recycler", "Pari Mutuel Urbain is No. 1 horse betting in France and third worldwide operator. It also offers a range of sports paris and online poker.", "Adif Railway management: circulation, infrastructure, stations, logistics facilities, international relations.", "A leading global food company built on four business lines: Essential Dairy and Plant Based Products, Early Life Nutrition, Waters and Medical Nutrition", "Standard control oil", "Brand of two discount supermarket chains with over 10,000 stores in 18 countries", "LEG Immobilien is a real estate company that focuses on the acquisition, sale, and leasing of real estate properties.", "Criteo is a global technology company that serves personalized online display advertisements to consumers on behalf of e-commerce companies.", "British Airways provides international and domestic scheduled air services for the carriage of passengers and cargo.", "BDO is an accounting and advisory firm in Canada.", "Advanced provide software & services for commercial, public and third sector organisations that make the complex simple.", "Global investment bank, offers financial products and services to corporate and institutional clients", "Deutsche Borse is an exchange company providing investors, financial institutions and companies with access to global capital markets.", "HypoVereinsbank is a bank that provides money management services.", "With its complementary geographic footprint, expertise and service offerings, Transdev offers a unique response to public transport needs.", "Business France is the national agency responsible for the development of exports and international investment in France.", "Hoffmann Group operates as a system partner for high-quality tools.", "GEFCO is a logistics company, supplier and provider of global and international logistics.", "Radisson operates and manages hotels and resorts in North America, Latin America, the Asia Pacific, Europe, the Middle East, and Africa.", "The British luxury car company, dedicated to developing and crafting the world’s most desirable high performance cars.", "Geodis provides transportation and logistics services in France, Europe, Southeast Asia, Africa, and Latin America.", "Halfords is the UK's leading retailer of motoring, cycling and leisure products and, through Halfords Autocentres.", "Beiersdorf AG is a German personal-care company based in Hamburg, manufacturing personal-care products and pressure-sensitive adhesives.", "The world’s largest academic book publisher, publisher of the world's most influential journals, and a pioneer in the field of open research", "TTS Tooltechnic Systems manufactures industrial tools and hardware products", "Next is engages in the retail of clothing, footwear, accessories, and home products for men, women, and children.", "Webedia is a web platform that provides users with celebrity news.", "Alliander is an energy network company.", "Germany's largest news and entertainment portal.", "mymuesli is a producer and distributor of breakfast cereals.", "Kiwa is an inspection and Certification With our certification, inspection, testing, training and consultancy services company", "Visma provides business software and services for accounting and administration.", "AVL is the world's largest privately owned and independent company for the development of powertrain systems with internal combustion", "KPMG India provides financial and business advisory, tax and regulatory, internal audit, and corporate governance services.", "We take pride in what the Toyota name represents—innovation, quality and reliability.", "APRR is a motorway operator company.", "Stadtwerke Dusseldorf is a reliable partner for all things electricity, natural gas, water and heat located in Dusseldorf.", "Radware provides application delivery and security solutions for virtual and cloud data centers.", "Leading provider of premium products and services for individual mobility", "CMA CGM is a shipping company that ships fleets, containers, and cargo.", "ADEO is a group in home improvement, DIY and decorating sectors.", "The GSMA is a trade group that represents network operators using GSM technology for their networks.", "A global management consulting, technology services and outsourcing company", "Vattenfall is a European energy company.", "One of the main French banking group", "Acronis is a cybersecurity company that offers safety, accessibility, privacy, authenticity, and security services", "The industry's most advanced and widely adopted augmented reality platform.", "Producer of platinum group metals", "Sopra is a leader in consulting, IT services and software development in Europe", "Statkraft is a leading company in hydropower internationally and Europe’s largest generator of renewable energy.", "Deliveroo owns and operates an online food delivery platform in the United Kingdom.", "Deloitte drives progress. Our firms around the world help clients become leaders wherever they choose to compete.", "LVMH Moet Hennessy Louis Vuitton engages in the design, manufacture, and sale of luxury products worldwide.", "British multinational banking and financial services company headquartered in London", "Amnesty International is a global charity organization of people fighting injustice and promoting human rights.", "Operates hypermarkets, supermarkets, and hard discount and convenience stores in Europe, Latin America, and Asia", "Designs, builds, operates & maintains user-friendly and energy-efficient technical solutions for buildings, industries & infrastructure.", "Opera Software develops web browsers for mobiles and desktops, mobile payment services and artificial intelligence solutions.", "Pioneering Underground Technologies", "ABB is a company provides power and automation technologies for smart grids, robotics, electric cars, renewable energy and motors.", "KPN is the leading Telecommunication and IT company in the Netherlands.", "It is the fifth largest retail financial institution in Switzerland.", "ABOUT YOU is an eCommerce platform for clothing, shoes and accessories.", "BT provides communications services to consumer and business sectors worldwide.", "Arriva is a providers of passenger transport in Europe.", "Barmer is one of the health insurance providers in Germany.", "Coast sells high end and upscale clothing and accessories via its website.", "France 24 is an international news and current affairs television channel that offers a French perspective on world events.", "Galeria Kaufhof GmbH is an International Trade and Development company located in Po Box 410104, , Dortmund, Nordrhein-Westfalen, Germany.", "Lindt & Sprüngli is a Swiss company that specializes in producing premium chocolates and confectioneries.", "Menzis is an Insurance Agency that provides various types of Insurances.", "Ferrero is a confectionary manufacturer known for Tic-Tacs, Nutella, Kinder, and their Pralines.", "O2 provides mobile and broadband services for individuals and businesses in the UK.", "ProSiebenSat.1 Media SE is a mass media company operating television, radio stations and print businesses.", "Digital newspaper", "PERI is one of the world's largest manufacturers and suppliers of formwork and scaffolding systems.", "Sage is an application to create payroll slip online and designed as per business requirements suitable for various sectors.", "BBDO is an online portal that provides information on advertising, brand communication, digital solutions, public affairs, and consulting.", "CERN provides particle accelerators and other infrastructure needed for high-energy physics research.", "Everest manufactures windows, doors & conservatories.", "Frank is a creative agency that helps brands plan, push and manage conversations of their own, generating insight-led promotions.", "Virgin Money is a independent banking group.", "Agriculture company helping to improve global food security", "Getinge identifies customer issues and promotes clinical and economic benefits and follow and support the customer decision process.", "REED is a recruiting and employment agency.", "Edenred is a leading services and payments platform and the everyday companion for people at work", "Chemicals production active in chemicals, plastics, performance products, functional solutions, oil and gas", "Producer of premium cars and manufacturer of commercial vehicles", "Home", "Intel designs, manufactures, and sells integrated digital technology platforms worldwide.", "The Mundipharma story, spanning over six decades, is one that brings together a visionary approach.", "NETZSCH is a manufacturer of progressing cavity, rotary lobe, downhole, dosing and barrel emptying pumps.", "UWV is an autonomous administrative authority specializing in temporary income, work, data management, and reintegration.", "BICS is recognized in the wholesale communications market as a top global voice carrier and the leading provider of mobile data services", "Bupa is an international healthcare group, serving over 22 million customers in over 190 countries.", "Commercial aircraft manufacturer that sets the standard for the aviation industry thought its customer focus and more", "Insurance coverage and services for private and commercial needs, capital formation, banking services", "Seat is a Spanish automobile manufacturer with its head office in Martorell, Spain.", "Egis is an international group offering engineering, project structuring and operations services.", "Top brands of glasses, sunglasses and contact lenses", "The Group carries out an ambitious program of development and renovation and extension that enhance its shopping centers", "FANUC America Corporation, is a supplier of robotic automation in the America.", "LafargeHolcim is a provider of R&D, innovative services, and comprehensive building solutions in the building materials industry.", "Actemium is a network of 300 Business Units 100% dedicated to industrial process.", "Gardena manufactures garden tools, garden ponds and pumps, and electric garden products.", "Manufactures residential, commercial, and industrial heating and climate systems", "Eni is an Italian energy company that engages in oil and natural gas exploration.", "Is a Swiss global financial services company that serves over 50 countries", "Johnson & Johnson engages in the research and development, manufacture and sale of a range of products in the healthcare field", "DLA Piper is a global law firm with lawyers located in more than 40 countries to helps clients with their legal needs around the world.", "Schroders is an asset management company.", "Salzburg is an energy, transport and telecommunications services provider company.", "Heineken is an international beer brand manufacturing company and retailer all over the world.", "Staatsbosbeheer makes under 'protect, experience and use' fit for the future they want to involve people to nature that affects them.", "Bonhams is an auctioneer that offers auction services to trade fine arts and antique goods.", "Rexel is a professional distributor of electrical products and services for the world of energy.", "PayU operates as an online payment service provider in global growth markets.", "Marazzi Group is a manufacturer and marketer of ceramic tile.", "Leading German automotive manufacturer", "Established in 1976, Louvre Hotels Group has a network of more than 1,100 hotels in 46 countries.", "Biomar is a delivering healthy & great tasting seafood company located in Grangemouth.", "Exertis is a technology distribution and specialist service providers.", "Leica Biosystems develops laboratory workflow solutions for anatomic pathology involved in the advancement of cancer diagnostics.", "Covestro is a supplier of high-tech polymer materials.", "ALPLA is packaging systems, bottles, caps and injection-moulded parts.", "Inditex is a fashion conglomerate that retails several clothing brands.", "Unilever produces and supplies fast moving consumer goods in food, and home and personal care product categories worldwide.", "Verizon Communications is a broadband and telecommunications company that provides information and entertainment services.", "Die Mobiliar is a furniture startup and an old private insurance company in Switzerland.", "Lesara is the leading global agile retail pioneer for amazing fashion merchandise at best prices.\r\n\r\nThe company has offices in China and Germany and since its launch in 2013 expanded into 24 markets in 7 languages across Europe, grew its assortment to more than 100.000 SKUs and the the team to over 300 employees.\r\n\r\nLesara is operating a completely vertically integrated supply chain and needs only 2 weeks from idea over design, production to product go-live for its collections.\r\n\r\nThe company was awarded as fastest growing tech-company in Europe in 2016.", "Adjust is an app marketing platform. The platform includes measurement, fraud prevention, cybersecurity & marketing automation products.", "AstraZeneca, a global pharmaceutical company, discovers, develops, manufactures and markets prescription medicines.", "EUMETSAT is an intergovernmental organisation.", "AXA Assistance is the global assistance specialist provider in Automotive, Travel, Home, Health and Life Care Services.", "Raiffeisen Bank is a financial organization that offers banking services to individuals and corporations.", "Schneider Electric is a company that creates products that help people conserve energy.", "CHECK24 is Germany's largest online comparison platform", "Stefanini is a buisness offering assistance to other businesses in the area of information processing.", "Pets at Home is the UK's largest pet supplies retailer, with more than 370 stores and 6,000 employees.", "Gameloft is an international publisher and developer of digitally-distributed video games specially designed for iOS, Android and Java.", "Missguided is a fresh and vibrant online store that aims to stay on top of the latest trends in order to provide their customers.", "Asklepios Kliniken is one of the private operators of hospitals and healthcare facilities in Germany.", "Leading provider of virtual data rooms in Europe", "William Hill is a is a bookmaker that provides online betting and gambling games for sports betting and gaming markets.", "Electrolux is a multinational home appliance manufacturer for professional use.", "Global technology conglomerate", "Paysafe is a global payments provider offering a range of payments solutions for businesses and consumers.", "Gousto is an online meal-kit manufacturer and retailer, using AI and automation to provide extensive choice and personalisation.", "A global integrated healthcare leader discovers, develops and distributes therapeutic solutions", "Howden is an engineering company producing custom engineered fans, compressors and air-heaters.", "Lenovo Group is a computer technology company that manufactures personal computers, smartphones, televisions, and wearable devices.", "Publicis Groupe is a digital and interactive communication services provider.", "Andra (National Agency for Radioactive Waste Management) is a public industrial and commercial (Epic)Founded in 1991.", "BayWa is a German company which operates in the agriculture, building materials and energy sectors.", "Leica Camera AG is an internationally operating manufacturer of cameras and sport optics products.", "Poland's leading media and telecommunications group - listed in Warsaw (WSE:CPS), controlled by Polish billionaire Mr Zygmunt Solorz-Żak", "UK leading independent fragrance retailer having no.1 webshop and 170+ stores", "VIB, a Belgium-based life sciences research institute, performs research for pharmaceutical, agricultural, and industrial applications.", "DEKRA | On the safe side", "Was founded 25 years ago on Tjark Auerbach's promise to \"make software that does good things for my friends and family\"", "Learn a language like you've always wanted to", "Pure is a digital radio manufacturer and engineering firm.", "SNCF is a travel and logistics service provider company. SNCF runs and manages SNCF voyage", "Unipol is Stock Company listed on the Italian Stock Exchange and holding company of a Group operating in the insurance and banking sector.", "Loewe provides leather goods, bags, ready-to-wear, accessories, perfumes, and silk products for men and women.", "Tryg is the second largest general insurer in the Nordic region present in Denmark.", "Eutelsat is a commercial satellite provider with coverage spanning the European continent, the Middle East, Africa India, and the Americas.", "CWT delivers efficient and innovative solutions to optimize travel and meetings and events management.", "Sofology Limited engages in the retail of sofas in United Kingdom.", "Westwing engages in the home and living e-commerce business and offers home decor products.", "Reckitt Benckiser Group is a consumer goods company makes health, hygiene and home products.", "Bet365 is an online gambling company that offers comprehensive in-play services for its clients.", "Scottish Enterprise is Scotland's main economic, enterprise, innovation and investment agency.", "Homeserve offers domestic house repair services to individuals, including boiling, plumbing, electrical, and insurance services.", "Hermes provides a range of flexible and affordable delivery options that are convenient for the consumer.", "EOS is the global technology and quality leader for high-end solutions in the field of additive manufacturing.", "Ford Motor is an automotive company that develops, manufactures, and distributes vehicles, parts, and accessories.", "Altarea is a leading real estate developer that supports urban transformation and facilitates new ways of consuming, working & living.", "Innogy is an energy company that generates energy from renewable sources and ensures that the electricity arrives at home.", "Ozon is a multi-category e-commerce platform that helps customers find product offerings from sellers of all sizes.", "SUSE provides reliable and interoperable Linux and cloud infrastructure solutions that give enterprises greater control and flexibility", "Global Healthcare Products Leader", "Book bus tickets for journeys across Europe", "N26 offers mobile banking in 25 markets.", "PayPal is a financial service company that provides online payment solutions to its users worldwide.", "Pearson operates as a media and education company that offers a wide range of services to its customers.", "Leading insurance groups in its core markets in Austria and Central and Eastern Europe", "Grundfos is a pump manufacturer, based in Denmark", "IBM is an IT technology and consulting firm providing computer hardware, software, infrastructure, and hosting services.", "One of the leading telecommunications companies in the world", "Multinational lighting manufacturer", "Refinitiv is a provider of financial markets data and infrastructure.", "Direct Assurance est un assurance en ligne, leader de l'assurance Auto en ligne", "Azets is the leading provider of outsourced accounting, payroll and HR services.", "Is one of the world’s leading designer lifestyle brands", "Sunrise is the largest private telco provider in Switzerland that covers mobile, landline network, internet and digital TV.", "RCSI is a clinical research center for a variety of medical research projects.", "Hansgrohe SE is a German sanitary fittings manufacturer.", "TVP is a public broadcasting corporation providing documentaries, news, film, and music.", "Groupama is a mutual insurance provider for individuals and companies.", "Chronopost provides express shipping and delivery services both domestically (in France) and internationally.", "Global science based company active in health, nutrition and materials", "Gett is a leading ground travel platform for businesses. We are transforming corporate travel with our mobility software.", "AT&S is a Europe based printed circuit board manufacturer focused on high end printed circuit board technology", "CzechInvest is the investment and business development agency of the Czech Republic, providing services to attract foreign investment.", "Groupe SEB deploys a long-term strategy focused on innovation, international development, competitiveness and service to clients.", "An independent global brewer", "Arsenal Football Club is a multi media production company representing a diverse & exciting international talent roster including Director.", "DIT is responsible for promoting UK trade across the world and ensuring the UK takes advantage of the huge opportunities open to us.", "HelloFresh is a food subscription company that sends pre-portioned ingredients to users’ doorstep each week.", "Keolis is a French-owned public transit operator servicing millions of passengers around the world.", "A leading pioneer in denim and casual fashion, known for moving outside and ahead of trends in its industry.", "Honeywell International is a technology and manufacturing company that offers energy, safety, and security solutions and technologies.", "Online food order and delivery service", "Shire biotechnology company that focuses on serving people with rare diseases.", "Fraunhofer IIS is one of the world’s leading application-oriented research institutions for microelectronic and IT system solutions", "Leader in gases, technologies and services for Industry and Health", "EMBL drives visionary research and technology development in the life sciences.", "Fortum’s purpose is to create energy that improves life for present and future generations.", "Deutsche Post delivers mail and parcels in Germany.", "Allianz offers a wide range of insurance and asset management products and information technology services.", "Roche is a pharmaceutical and diagnostics company that focused on improving people’s lives.", "The world’s leading events organiser", "Automotive technology, naturally", "UNESCO encourages international peace and universal respect for human rights by promoting collaboration among nations.", "Starling Bank provides a mobile banking application and a debit card that enable users to manage their finances.", "Gamma is a leading supplier of voice, data and mobile products and services in the UK.", "​Vallourec is the world leader in premium tubular solutions primarily serving the energy markets", "Automation technology, performance leader in industrial training & education programs", "Novo Nordisk is a global healthcare company with more than 90 years of innovation and leadership in diabetes care.", "Largest independent airline ticket wholesaler in Germany", "Tinexta S.p.A is a dynamic and rapidly growing Group.", "Linney is a marketing agency that specializes in making marketing work & combining traditional market research.", "Montblanc offers watches, leather, jewelry, eyewear, and fragrance for men and women.", "Irdeto is a software security and media technology company that allows new forms of distribution for broadcast and mobile entertainment.", "Bringing great ideas to life", "Manufacturer of dowel basket assemblies for jointed paving and highway construction", "Zodiac Aerospace is a world leader in aerospace equipment and systems for commercial, regional and business aircraft.", "BOMAG is the world market leader in the field of Compaction Technology and manufacture of machines for the compaction of soils asphalt.", "News UK is a great company full of talented, dedicated and creative people.", "Wargaming is a game development platform that publishes free-to-play MMO games online.", "American Honda is an automotive company that combines product sales, service, and coordinating functions of Honda.", "Innovative mobility solutions that stand for clean air, fuel efficiency, and driving pleasure", "C2C-NewCap has developed a breakthrough supercapacitor contributing towards more sustainable mobility.", "Red Bull Energy Drink is a functional beverage providing various benefits to its customers.", "Econocom designs, finances and oversees companies digital transformation.", "Nottingham University Hospitals is a chain of hospitals that offers training, eye casualty, maternity, education and health services.", "A Scientific body active in the fields of food safety, occupational and environmental health, animal health and well-being.", "Rhein Energie provides electricity, water, gas, and heat for business customers, large industry, real estate industry, and public utilities.", "Office Holdings is the UK’s young fashion footwear retailer, offering a product range that is mid-priced and affordable.", "Novartis is a healthcare company that provides solutions to address the evolving needs of patients worldwide.", "Nordea Bank offers a range of financial products and services, including Netbank, online investment, telephone banking, and cash dispensers.", "DESY is a German accelerator center, develops, builds, and operates large particle accelerators used to investigate the structure of matter.", "Is a company that specializes in sports clothing, footwear, apparel, and accessories", "Leonardo is a global high-tech company specializing in aerospace, security, and defense.", "Vestas is the only global energy company dedicated exclusively to wind energy. Wind is our business and our passion.", "Groupe Auchan SA is a French international retail group and multinational corporation headquartered in Croix, France", "Wide variety of products in the Home and Furniture segment", "Adevinta is a digital marketplace that provides online classifieds services.", "World renowned for our distinctive range of quality audio, picture and multimedia products since 1925", "Rolex is a manufacturing company that designs and manufactures watches for men and women.", "Trainline is the world’s leading independent digital rail platform.", "Cloud connected gym equipment and supporting cloud software", "TUV SUD is an international service corporation focusing on consulting, testing, certification and training.", "Accor is a French multinational hospitality company that owns, manages & franchises hotels, resorts & vacation properties.", "Leading international provider of electronic payment and risk management solutions", "Funding Circle is a lending platform for small businesses.", "Givaudan is a company that makes and distribute flavours and fragrance for firms and retailers.", "Adidas is a global sports brand that manufactures apparel, accessories, and footwear for professional athletes involved in various sports.", "The Zurich Insurance Group is a multi-line insurance provider that delivers general insurance and life insurance products and services.", "VINCI is a global player in concessions and construction, employing close to 191,000 people in some 100 countries."]